Autodesk.Revit.DB.Architecture.RailingSlopeOption
The option determines the slope of the railing.
Since:
2013

Autodesk.Revit.DB.Architecture.RailingSlopeOption.Sloped
The slope of the railing will be specified by users.

Autodesk.Revit.DB.Architecture.RailingSlopeOption.Flat
The slope of the railing will be kept flat.

Autodesk.Revit.DB.Architecture.RailingSlopeOption.ByHost
The slope of the railing is determined by its host.